#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details open><summary>Show Plan</summary>

```hcl
terraform
spectrocloud_cloudaccount_aws.this["account-aws-1.yaml"]: Refreshing state... [id=60b90d90e937ea9f1cd9c4f5]
spectrocloud_cluster_profile.this: Refreshing state... [id=60b90d90e937ea9f1fc22595]
spectrocloud_cluster_eks.this["cluster-eks-dev-1.yaml"]: Refreshing state... [id=60b90d90e937ea9f25ff2bcb]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # spectrocloud_cluster_eks.this["cluster-eks-dev-1.yaml"] has been deleted
  - resource "spectrocloud_cluster_eks" "this" {
      - cloud_account_id = "60b90d90e937ea9f1cd9c4f5" -> null
      - id               = "60b90d90e937ea9f25ff2bcb" -> null
      - name             = "eks-dev-1" -> null

      - cloud_config {
          - az_subnets      = {
              - "us-west-2a" = "subnet-07f0af093b8233990,subnet-080b9dc42d15b57a2"
              - "us-west-2b" = "subnet-0e0d96dc7ad3f02a5,subnet-025428faaddc4201f"
              - "us-west-2c" = "subnet-09e74165071ce03e6,subnet-0964e92baa663e495"
            } -> null
          - endpoint_access = "public" -> null
          - region          = "us-east-1" -> null
          - vpc_id          = "vpc-0c9679602584608f9" -> null
        }

      - cluster_profile {
          - id = "60b90d90e937ea9f1fc22595" -> null

          - pack {
              - name   = "spectro-rbac" -> null
              - tag    = "1.0.0" -> null
              - values = <<-EOT
                    charts:
                      spectro-rbac:
                        clusterRoleBindings:
                        - role: "view"
                          subjects:
                          - name: "user6"
                            type: "User"
                          - name: "group6"
                            type: "Group"
                          - name: "group6"
                            namespace: "foo"
                            type: "ServiceAccount"
                        namespaces:
                        - createNamespace: true
                          namespace: "team2"
                          roleBindings:
                          - kind: "ClusterRole"
                            role: "admin"
                            subjects:
                            - name: "team-vendor-b"
                              type: "Group"
                        
                EOT -> null
            }
        }

      - fargate_profile {
          - additional_tags = {
              - "hello" = "test1"
            } -> null
          - name            = "fg-1" -> null
          - subnets         = [
              - "subnet-07f0af093b8233990",
              - "subnet-0e0d96dc7ad3f02a5",
              - "subnet-09e74165071ce03e6",
            ] -> null

          - selector {
              - labels    = {
                  - "abc" = "cool"
                } -> null
              - namespace = "fargate" -> null
            }
        }

      - machine_pool {
          - az_subnets    = {
              - "us-west-2a" = "subnet-07f0af093b8233990"
              - "us-west-2b" = "subnet-0e0d96dc7ad3f02a5"
              - "us-west-2c" = "subnet-09e74165071ce03e6"
            } -> null
          - count         = 3 -> null
          - disk_size_gb  = 61 -> null
          - instance_type = "t3.large" -> null
          - name          = "worker-basic" -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # spectrocloud_cloudaccount_aws.this["account-aws-1"] will be created
  + resource "spectrocloud_cloudaccount_aws" "this" {
      + arn         = "arn:aws:iam::593235963820:role/spectro-picard-aws"
      + external_id = (sensitive value)
      + id          = (known after apply)
      + name        = "aws-account-1"
      + type        = "sts"
    }

  # spectrocloud_cloudaccount_aws.this["account-aws-1.yaml"] will be destroyed
  - resource "spectrocloud_cloudaccount_aws" "this" {
      - arn         = "arn:aws:iam::593235963820:role/spectro-picard-aws" -> null
      - external_id = (sensitive value)
      - id          = "60b90d90e937ea9f1cd9c4f5" -> null
      - name        = "aws-account-1" -> null
      - type        = "sts" -> null
    }

  # spectrocloud_cluster_eks.this["cluster-eks-dev-1"] will be created
  + resource "spectrocloud_cluster_eks" "this" {
      + cloud_account_id = (known after apply)
      + cloud_config_id  = (known after apply)
      + id               = (known after apply)
      + kubeconfig       = (known after apply)
      + name             = "eks-dev-1"

      + cloud_config {
          + az_subnets      = {
              + "us-west-2a" = "subnet-07f0af093b8233990,subnet-080b9dc42d15b57a2"
              + "us-west-2b" = "subnet-0e0d96dc7ad3f02a5,subnet-025428faaddc4201f"
              + "us-west-2c" = "subnet-09e74165071ce03e6,subnet-0964e92baa663e495"
            }
          + endpoint_access = "public"
          + region          = "us-east-1"
          + vpc_id          = "vpc-0c9679602584608f9"
        }

      + cluster_profile {
          + id = "60b90d90e937ea9f1fc22595"

          + pack {
              + name   = "spectro-rbac"
              + tag    = "1.0.0"
              + values = <<-EOT
                    charts:
                      spectro-rbac:
                        clusterRoleBindings:
                        - role: "view"
                          subjects:
                          - name: "user6"
                            type: "User"
                          - name: "group6"
                            type: "Group"
                          - name: "group6"
                            namespace: "foo"
                            type: "ServiceAccount"
                        namespaces:
                        - createNamespace: true
                          namespace: "team2"
                          roleBindings:
                          - kind: "ClusterRole"
                            role: "admin"
                            subjects:
                            - name: "team-vendor-b"
                              type: "Group"
                        
                EOT
            }
        }

      + fargate_profile {
          + additional_tags = {
              + "hello" = "test1"
            }
          + name            = "fg-1"
          + subnets         = [
              + "subnet-07f0af093b8233990",
              + "subnet-0e0d96dc7ad3f02a5",
              + "subnet-09e74165071ce03e6",
            ]

          + selector {
              + labels    = {
                  + "abc" = "cool"
                }
              + namespace = "fargate"
            }
        }

      + machine_pool {
          + az_subnets    = {
              + "us-west-2a" = "subnet-07f0af093b8233990"
              + "us-west-2b" = "subnet-0e0d96dc7ad3f02a5"
              + "us-west-2c" = "subnet-09e74165071ce03e6"
            }
          + count         = 3
          + disk_size_gb  = 61
          + instance_type = "t3.large"
          + name          = "worker-basic"
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @saamalik, Action: `pull_request`, Working Directory: `.`, Workflow: `Terraform Plan`*